// let jobs = [
//   {xz:"8-12", type: '工艺类', zn: '工业工程师', jobname: 'IE工程师', addr: '上海', zhuanye: '交通/运输/物流类', zz: '学历要求:本科及以上<br>所需专业:工业工程、数学、信息管理、电力电子等相关专业<br>岗位职责:<br>1、负责产能产线规划、生产现场优化、制造成本改善、工厂布局设计等方面相关工作。包含但不限于以下方面:<br>2、 负责精益生产、IE改善技术的研究；<br>3、 运用精益手法分析、发现问题，组织对当前制造相关流程、工艺方法、制造成本等提出改善建设方案；<br>4、根据产能情况组织开展例行性短中长期规划、组织设计解决方案并推动实施；<br>5、 根据组织架构与规划发展需要，开展制造工厂布局设计与优化。<br>任职要求:<br>1、了解电子行业相关制造标准，了解生产制造流程；<br>2、具备较强的统筹规划能力和系统协调能力；<br>3 、具有良好的语言文字表达能力与结构化思维，具有团队合作精神。<br>；', link: 'https://xym.51job.com/personal/personal_applyjob.aspx?ctmid=6393432&jobid=150585250', xl: '本科'},
//   {xz:"8-12", type: '工艺类', zn: '测试工程师', jobname: '测试工程师', addr: '上海', zhuanye: '交通/运输/物流类', zz: '学历要求:本科及以上<br>所需专业:自动化、电气工程、电子信息工程等相关专业<br>岗位职责:<br>1、处理电子产品故障原因分析定位；<br>2、进行新研电子产品调试测试；<br>3、编制电子产品故障排查定位方法以及知识积累；<br>4、编制电子产品专用测试设备技术需求书以及固定资产报告；<br>5、调研行业内在测试领域新技术，提升配电产品在测试方面工作效率；<br>6、研究设计产品测试工装优化测试方法。<br>任职要求:<br>1、具有扎实的数字、模拟电路专业理论基础，熟悉单片机、DSP等处理器的原理及外围电路电路设计；<br>2、熟练使用常见万用表、示波器、电子负载仪表设备；<br>3、具有硬件电路电路分析和设计能力、调试和问题解决能力者优先；<br>4、熟悉C++、C#、Java、Python等编程语言者优先。；', link: 'https://xym.51job.com/personal/personal_applyjob.aspx?ctmid=6393432&jobid=150585251', xl: '本科'},
//   {xz:"8-12", type: '工艺类', zn: '产品工艺/制程工程师', jobname: '产品工程师', addr: '上海', zhuanye: '交通/运输/物流类', zz: '学历要求:本科及以上<br>所需专业:机械工程、电子信息工程、电气工程、自动化、光学工程等相关专业<br>岗位职责:<br>1、承担航空防务和非航空防务的产品制造工艺，根据产品图纸要求和产品规范要求编制工艺文件指导生产；<br>2、能够及时有效的处理装配现场在生产过程中的异常情况；<br>3、对生产过程中或外场使用中出现的故障，及时准确定位，快速排除；<br>4、积极研究新工艺，新方法，不断创新，提高现有工艺能力。<br>任职要求:<br>1、具备扎实的模电、数电和电路分析或光学的专业知识基础；<br>2、熟悉运用AutoCAD、protel等常用软件或熟悉LED照明及常用LED光学特性掌握一款光学软件；<br>3、工作踏实认真细致，有良好的沟通协调能力。；', link: 'https://xym.51job.com/personal/personal_applyjob.aspx?ctmid=6393432&jobid=150585252', xl: '本科'},
//   {xz:"12-15", type: '研发类', zn: '变压器与磁电工程师', jobname: '电磁兼容工程师', addr: '上海', zhuanye: '交通/运输/物流类', zz: '学历要求:硕士及以上<br>所需专业:电气工程、微电子学与固体电子学、电磁场与微波技术等相关专业<br>岗位职责:<br>1、参与产品电磁兼容性设计、分析、试验、验证等相关工作；<br>2、负责航空电子产品的结构屏蔽效能仿真，电路电磁辐射仿真，电路的SI/PI仿真等方面工作；<br>3、参与项目评审，对产品的电磁兼容性设计进行评估；并提供改进意见或者建议；<br>4、负责电容兼容性设计相关文档编制；<br>5、负责电磁兼容性相关流程的制定和改进。<br>任职要求:<br>1、熟练使用或了解电磁兼容仪器设备、频谱仪、接收机等；<br>2、具备电磁场与微波技术相关专业的基础知识；<br>3、具备数电，模电、射频电路等相关专业的基础知识；<br>4、能运用CST/HFSS/FEKO/ADS 等软件者优先；<br>5、具有EMC测试或整改经验者优先；<br>6、工作勤恳、品行端正，有较强的的责任意识和良好的团队精神。 ；', link: 'https://xym.51job.com/personal/personal_applyjob.aspx?ctmid=6393432&jobid=150585253', xl: '硕士'},
//   {xz:"12-15", type: '研发类', zn: '电气工程师/技术员', jobname: '电气工程师', addr: '上海', zhuanye: '交通/运输/物流类', zz: '学历要求:硕士研究生<br>所需专业:自动化、电气工程、机电一体化等相关专业<br>岗位职责:<br>1、按照项目要求完成方案、器件选型、原理图设计、调试、测试等工作，并负责产品的设计质量；<br>2、编写产品研制过程各种支撑性文件；<br>3、负责承担产品的生产、外场质量问题的处理及技术支持工作；<br>4、跟踪研究专业技术领域的技术发展；<br>5、开展配电控制技术的知识积累及成果申报。<br>任职要求:<br>1、具有扎实的电气工程专业理论基础，熟悉工业、自动化电气设计；<br>2、熟练掌握caxa等电气图设计工具者优先；<br>3、具有工业自动化设备分析和设计能力、调试和问题解决能力者优先；<br>4、熟悉项目的统筹与管控，有良好的沟通协调能力，良好的团队精神。；', link: 'https://xym.51job.com/personal/personal_applyjob.aspx?ctmid=6393432&jobid=150585254', xl: '硕士'},
//   {xz:"12-15", type: '研发类', zn: '材料工程师', jobname: '高分子材料工程师', addr: '上海', zhuanye: '交通/运输/物流类', zz: '学历要求:硕士研究生<br>所需专业:高分子材料科学、高分子化学相关专业<br>岗位职责:<br>1、开展高性能导电材料及其在隐身方向应用研究；<br>2、开展进行多功能电磁屏蔽/吸波材料研究和应用；<br>3、开展进行隐身涂层产线建设和工艺研究。<br>任职要求:<br>1、具有导电材料、透明导电膜材料开发经验者优先；<br>2、具备导电复合材料、高分子材料、电磁屏蔽材料、电磁波理论等研究背景；<br>3、具备导电材料、电磁屏蔽材料工艺研究经验者优先；<br>4、有较强的的学习能力和项目开发经验。<br>；', link: 'https://xym.51job.com/personal/personal_applyjob.aspx?ctmid=6393432&jobid=150585255', xl: '硕士'},
//   {xz:"12-15", type: '研发类', zn: '工业设计/产品设计', jobname: '工业设计工程师', addr: '上海', zhuanye: '交通/运输/物流类', zz: '学历要求:硕士研究生<br>所需专业:工业设计、数字媒体艺术、工业工程等相关专业<br>岗位职责:<br>1.客户对接，按照客户及产品特点要求完成特种功能舱室总体视觉效果设计，善于用营销概念表达设计创意及体验创新逻辑；<br>2.根据特种装备使用需要，负责特种功能舱室总体方案设计构思，把握设计方向与风格，开展细节设计、CMF等；<br>3.完成效果转化，将工业设计效果转化为结构设计等工作；<br>4.编写产品研制过程各种支撑性文件；<br>5.了解和收集行业信息趋势，视觉表达趋势；<br>6.开展工业设计技术的知识积累及成果申报；<br>7.配合部门做好其他设计相关工作。<br>任职要求:<br>1.具有较好的设计分析及设计表现力，有良好的绘制表达能力；<br>2.熟练掌握（PS，CorelDRAW，3dsmax，catia）等设计软件；<br>3.具有特种功能舱室，车辆造型设计能力者优先；<br>4.善于独立思考，对结构实现、工艺材料等有基本了解；<br>5.熟悉项目的统筹与管控，有良好的沟通协调能力，良好的团队精神。；', link: 'https://xym.51job.com/personal/personal_applyjob.aspx?ctmid=6393432&jobid=150585257', xl: '硕士'},
//   {xz:"12-15", type: '研发类', zn: '激光/光电子技术', jobname: '光学工程师（LED球幕）', addr: '上海', zhuanye: '交通/运输/物流类', zz: '学历要求:硕士研究生<br>所需专业:光学、光学工程、精密仪器、机械等相关专业<br>岗位职责:<br>1、按需求进行光路分析、光路设计工作；<br>2、负责产品光性能测试’现场光学产品调试；<br>3、负责产品的图纸发布，外协生产跟踪；<br>4、结合项目需求进行产品的方案编写，各类支撑文件编写；<br>5、负责LED屏幕现场监督，根据图纸进行施工；<br>6、负责各类型显示系统设计。<br>任职要求:<br>1、了解LED屏幕显示系统工作原理；<br>2、了解光路分析软件；<br>3、了解LED屏幕的驱动，使用调试方式；<br>4、具备视图能力，能够通过图纸进行现场施工；<br>5、熟练使用CAD/CATIA/Solidworks等二维、三维软件；<br>6、了解大型LED屏幕系统架构及工作原理。；', link: 'https://xym.51job.com/personal/personal_applyjob.aspx?ctmid=6393432&jobid=150585258', xl: '硕士'},
//   {xz:"12-15", type: '研发类', zn: '激光/光电子技术', jobname: '光学工程师（激光强光照明）', addr: '上海', zhuanye: '交通/运输/物流类', zz: '学历要求:硕士研究生<br>所需专业:光学科学与技术、光学工程、物理学等相关专业<br>岗位职责:<br>1、配合系统工程师进行需求管理保障工作；<br>2、按需求分解出光学子需求，开展光学零件、组件设计工作，开展光学仿真确定光学详细设计方案；<br>3、负责产品设计、制造、验证、交付过程中光学设计迭代和技术问题处理；<br>4、负责产品评审基础支撑工作，根据评审意见认真落实技术归零，完成光学专业所需文件编制；<br>5、负责产品光学图纸出版工作，负责光学零部组件、装配等图出版工作；<br>6、负责系统/产品光性能测试验证、照明实验工作。<br>任职要求:<br>1、至少熟练使用一款光学软件（DIALux、TracePro、lightools等）；<br>2、对几何光学有较深理论基础；<br>3、对光学零组件加工工艺、注塑模具、滤光材料等有基本认识；<br>4、具有较强的沟通能力、高度责任心、良好的创新精神和团队精神；<br>5、有LED光源或照明环境光学设计仿真课题经验者优先。；', link: 'https://xym.51job.com/personal/personal_applyjob.aspx?ctmid=6393432&jobid=150585259', xl: '硕士'},
//   {xz:"12-15", type: '研发类', zn: '激光/光电子技术', jobname: '光学工程师（拒止类武器）', addr: '上海', zhuanye: '交通/运输/物流类', zz: '学历要求:博士研究生<br>所需专业:光学、光学工程、测试计量技术区仪器等光学相关专业<br>岗位职责:<br>1、负责激光应用光学方向前沿技术跟踪、调研和课题申报工作；<br>2、负责调研及对接客户需求，规划新产品技术路线，并完成技术预研工作；<br>3、负责光学零件、组件设计工作，开展光学仿真确定光学详细设计方案；<br>4、负责产品设计、制造、验证、交付过程中光学设计迭代和技术问题处理；<br>5、负责系统/产品光性能测试验证、照明实验工作。<br>任职要求:<br>1、熟练掌握Zeamx、CodeV等光学设计工具，掌握成像、照明、检测的技术原理，能够设计光学系统实现功能性能指标；<br>2、熟悉激光器、成像光学元件、激光光学元件等光学测试设备，了解国内外激光器发展现状和光学元件主流加工水平，精通成像光学设计；<br>3、精通光学系统性能评价指标以及判断标准，精通必要的光学检测设备以及测量方法；<br>4、具备扎实的光学理论基础，熟悉物理光学和几何光学，对光学理论有着深刻的认识，能够根据设计等要求独立完成光学仪器设备及各光学器件选型和测试，提供完整可行的光学系统解决方案。<br>5、有激光光源、激光材料或照明环境光学设计仿真课题经验者优先。；', link: 'https://xym.51job.com/personal/personal_applyjob.aspx?ctmid=6393432&jobid=150585260', xl: '博士'},
//   {xz:"8-12", type: '专业技术类', zn: '技术支持/维护工程师', jobname: '技术支持工程师', addr: '上海', zhuanye: '交通/运输/物流类', zz: '学历要求:本科及以上<br>所需专业:机械工程、自动化、电气工程等相关专业<br>岗位职责:<br>1．负责部门装备/产品交接装；<br>2．负责部门装备/产品外场技术维护保障；<br>3．负责部门装备/产品客户培训；<br>任职要求:<br>1. 具备客户对接交装能力；<br>2. 具备良好的沟通表达能力；<br>3. 具有基本产品结构、软硬件设计知识，可完成产品外场的基本调试。<br>4. 具备良好的分析和解决问题的能力，可迅速分析故障原因，进行维修方式判断。<br>5. 具备良好逻辑思维能力，可完成客户培训工作。<br>6. 有爱国奉献精神，有国防保密意识，能适应紧张繁重工作；', link: 'https://xym.51job.com/personal/personal_applyjob.aspx?ctmid=6393432&jobid=150585261', xl: '本科'},
//   {xz:"12-15", type: '研发类', zn: '结构工程师', jobname: '结构工程师', addr: '上海', zhuanye: '交通/运输/物流类', zz: '学历要求:硕士研究生<br>所需专业:机械制造及其自动化、机械设计及理论、工业设计等相关专业<br>岗位职责:<br>1、负责与用户协调沟通产品相关的技术条件，并给予用户相关支持；<br>2、负责产品结构部分的设计及相关工作，包括器件选型、建立三维模型、以及结构部分图纸出版；<br>3、负责产品相关文档的编写，并参加产品相关的各类评审；<br>4、开展现有器件的质量提升涉及的制造技术攻关。<br>任职要求:<br>1、扎实的机械专业知识，理论力学、材料力学、机械原理、机械设计、电工电子成绩优秀；<br>2、熟悉机械制图、工程力学、材料加工，能够熟练使用AUTOCAD、CATIA、Altium Designer等设计软件；<br>3、具有精益求精的工作心态、良好的团队合作意识、较强的创新能力；<br>4、具备结构专业CAE软件仿真分析能力者优先考虑；<br>5、具有结构设计的项目经历，并完成全部生产过程的优先。；', link: 'https://xym.51job.com/personal/personal_applyjob.aspx?ctmid=6393432&jobid=150585262', xl: '硕士'},
//   {xz:"12-15", type: '研发类', zn: '可靠度工程师', jobname: '可靠性工程师', addr: '上海', zhuanye: '交通/运输/物流类', zz: '学历要求:硕士研究生<br>所需专业:电子信息工程、通信工程、 自动化、可靠性、交通运输工程等相关专业<br>岗位职责:<br>1.负责电子类及机电类产品的可靠性、安全性、维修性、测试性等工作规划；<br>2.捕获、维护和管理可靠性、安全性、维修性、测试性需求；<br>3.提供有效的可靠性技术支持；<br>4.参与审核并指导产品的可靠性设计与分析；<br>5.组织并推动开展FMEA、FTA等工作；<br>6.负责可靠性试验的策划管理及大纲编制指导工作；<br>7.能够对试验数据进行分析并根据产品外场使用数据进行可靠性评估工作。<br>任职要求:<br>1.熟悉国内外可靠性标准；<br>2.掌握可靠性分析软件，掌握可靠性分配、预计、评估方法；<br>3.能够完成FMEA、FTA、设计分析等工作；<br>4.具备可靠性试验策划及试验数据分析能力；<br>5.工作积极主动、吃苦耐劳、有责任心，具有良好的沟通能力及团队协作能力。；', link: 'https://xym.51job.com/personal/personal_applyjob.aspx?ctmid=6393432&jobid=150585263', xl: '硕士'},
//   {xz:"12-15", type: '研发类', zn: '软件工程师', jobname: '软件工程师（测试）', addr: '上海', zhuanye: '交通/运输/物流类', zz: '学历要求:硕士研究生<br>所需专业:计算机科学与技术、软件工程、机械工程等相关专业<br>岗位职责:<br>1、负责产品软件测试、验证及相关研制文档输出；<br>2、负责产品软件编码调试、测试；<br>3、负责产品功能验证、调试检测及故障处理工作。<br>任职要求:<br>1、掌握使用Keil工具进行单片机平台的软件编译、程序烧录；<br>2、掌握使用quatusII工具进行CPLD程序的烧写；<br>3、掌握使用xilinx工具进行FPGA程序的开发；<br>4、有testbed软件使用经验者优先考虑。；', link: 'https://xym.51job.com/personal/personal_applyjob.aspx?ctmid=6393432&jobid=150585265', xl: '硕士'},
//   {xz:"12-15", type: '研发类', zn: '软件工程师', jobname: '软件工程师（嵌入式）', addr: '上海', zhuanye: '交通/运输/物流类', zz: '学历要求:硕士研究生<br>所需专业:计算机科学与技术、自动化、软件工程、机械工程等相关专业<br>岗位职责:<br>1、嵌入式系统产品驱动开发，配合硬件调试、验证；<br>2、嵌入式产品软件开发，嵌入式软件编码实现，调试；<br>3、完成通信接口协议定义，实现通信控制、功能模块级联试；<br>4、负责完成产品的测试工作，如单元测试、单元集成测试、配置项测试系统测试；<br>5、参与编制软件研发过程中的文档。<br>任职要求:<br>1、熟悉单片机、DSP、Linux、Vxworks等一种或者多种嵌入式平台；<br>2、熟悉C/C++/C#，有良好的编程习惯和技巧及技术文档写作能力；<br>3、具有数电模电基础，熟悉软件开发流程；<br>4、熟悉基本的软件测试理论，熟悉软件测试的基本方法、流程和规范；<br>5、具有良好的沟通能力和团队合作能力，具有强烈的责任人和钻研精神；<br>6、具有嵌入式软件的项目经验者优先；；', link: 'https://xym.51job.com/personal/personal_applyjob.aspx?ctmid=6393432&jobid=150585266', xl: '硕士'},
//   {xz:"8-12", type: '专业技术类', zn: '实验室负责人/工程师', jobname: '试验工程师', addr: '上海', zhuanye: '交通/运输/物流类', zz: '学历要求:本科及以上<br>所需专业:电气工程、机械设计、制造及自动化、力学相关专业<br>岗位职责:<br>1、按试验规程或技术规范、试验大纲进行各种试验，并真实有效地填写试验原始记录；<br>2、解决试验过程中的技术难题，配合故障分析、处理；<br>3、参与试验过程中发现的各种故障的分析处理，并提出处理意见，不断完善试验操作过程<br>4、编制有试验类产品标准，促进试验操作规范化。<br>任职要求:<br>1、熟练使用实验室测试仪器，如示波器，频谱分析仪等；<br>2、具备基本的电工电路基础，能看懂电路原理图，有可靠性试验数据统计分析能力；<br>3、具有较强的沟通能力、高度负责心、良好的创新精神和团队精神；<br>4、有环境实验室实习经验者优先。；', link: 'https://xym.51job.com/personal/personal_applyjob.aspx?ctmid=6393432&jobid=150585267', xl: '本科'},
//   {xz:"12-15", type: '研发类', zn: '算法工程师', jobname: '算法工程师（AI）', addr: '上海', zhuanye: '交通/运输/物流类', zz: '学历要求:硕士研究生<br>所需专业:计算机科学与技术、软件工程、模式识别与智能系统等相关专业<br>岗位职责:<br>1、从事至少以下一种算法的研发:图像识别、语音识别、自然语言处理、声纹识别、语种识别、音频信号处理、手势识别、人脸识别、目标检测、动作检测；<br>2、开展机器学习、深度学习等相关算法理论研究，探索人工智能在航空领域的应用并进行原理样机的开发工作<br>3、参与公司AI科研项目的开发工作，完成相关算法和软件功能开发。<br><br>任职要求:<br>1、具备扎实的模式识别、图像处理、机器学习、自然语言处理、语音识别等知识和项目研发经验，对深度学习理论有一定的研究和应用经历；<br>2、良好的编程基础，掌握c/c++/python等编程开发语言和常用数据结构；<br>3、熟悉人工智能相关领域的最新进展和技术，擅于文献整理和信息情报收集，具有较强的英文阅读能力和科研论文撰写能力；<br>4、具备良好的创新和团队合作精神，能承受一定的工作压力。；', link: 'https://xym.51job.com/personal/personal_applyjob.aspx?ctmid=6393432&jobid=150585268', xl: '硕士'},
//   {xz:"12-15", type: '研发类', zn: '算法工程师', jobname: '算法工程师（导航）', addr: '上海', zhuanye: '交通/运输/物流类', zz: '学历要求:硕士研究生<br>所需专业:自动化、导航、制导与控制等相关专业<br>岗位职责:<br>1、 融合定位及组合导航算法研究；<br>2、行业前沿技术及解决方案调研；<br>3、前沿技术及算法的仿真及工程化实现；<br>4、系统产品的研制及测试验证；<br>5、协助开展产品的市场推广应用及相关工作。<br><br>任职要求:<br>1、导航、制导与控制，飞行控制，控制工程与控制理论相关专业,硕士或博士；<br>2、具备惯性导航、组合导航定位的算法研究、仿真经验优先；<br>3、具备图像、IMU、LIDAR等的组合导航定位技术研究经验；<br>4、掌握基本的组合导航定位算法卡尔曼滤波算法、粒子滤波等相关算法；<br>5、具有较强的独立科研能力，能熟练进行文献检索和综述；<br>6、工作主动认真，具有较强的学习能力，乐于沟通，有团队意识。；', link: 'https://xym.51job.com/personal/personal_applyjob.aspx?ctmid=6393432&jobid=150585269', xl: '硕士'},
//   {xz:"12-15", type: '研发类', zn: '算法工程师', jobname: '算法工程师（近地告警）', addr: '上海', zhuanye: '交通/运输/物流类', zz: '学历要求:硕士研究生<br>所需专业:自动化、导航、制导与控制、飞行器设计、计算机科学与技术等相关专业<br>岗位职责:<br>1、飞行动力学及运动学特性建模与研究；<br>2、实时规避预测、轨迹规划与控制算法研究；<br>3、国内同产品技术前沿跟踪研究；<br>4、低空飞行安全防撞技术的工程化与验证技术研究；<br>5、同类产品的研制与系统测试研制；<br>6、开展地形辅助导航，在飞机近地告警、导航定位等方面的工程化应用研究。<br>任职要求:<br>1、导航、制导与控制，飞行控制，控制工程与控制理论相关专业,硕士或博士；<br>2、具有飞行动力学建模及控制系统设计仿真经验优先；<br>3、具有近地告警/地形防撞/地形跟随/地形规避等相关方向研究经验者优先；<br>4、具有较强的独立科研能力，能熟练进行文献检索和综述；<br>5、工作主动认真，具有较强的学习能力，乐于沟通，有团队意识。；', link: 'https://xym.51job.com/personal/personal_applyjob.aspx?ctmid=6393432&jobid=150585270', xl: '硕士'},
//   {xz:"12-15", type: '研发类', zn: '通信技术工程师', jobname: '通信工程师', addr: '上海', zhuanye: '交通/运输/物流类', zz: '学历要求:硕士研究生<br>所需专业:电子信息工程、通信工程等相关专业<br>岗位职责:<br>1.客户前期通信方案对接，理解客户需求，梳理外部产品和内部设备交联关系；<br>2.通信设备类选型设计及协议，相关技术文件编制；网络设备的验收、调测等技术支持；<br>3.搭建设备bom及编制电气连接图纸；<br>4.负责产品研发过程中的通信问题解决；<br>5.进行产品研发过程中通信方面的经验积累和成果申报；<br>6.配合客户进行系统联调联试、升级维护和排故；<br>7.配合其他技术工程师设计相关工作<br>任职要求:<br>1.具备一定技术背景，熟悉通信设备软硬件设计及开发，掌握主流开发工具；<br>2.数量掌握网络基础理论和路由器、交换机等网络设备；<br>3.刻苦耐劳，能独立出差完成任务，具备良好的沟通和学习能力，良好的团队及创新精神。；', link: 'https://xym.51job.com/personal/personal_applyjob.aspx?ctmid=6393432&jobid=150585271', xl: '硕士'},
//   {xz:"12-15", type: '研发类', zn: 'FPGA开发工程师', jobname: '图像处理工程师', addr: '上海', zhuanye: '交通/运输/物流类', zz: '学历要求:硕士研究生<br>所需专业:计算机科学与技术、软件工程、光学、光学工程等相关专业<br>岗位职责:<br>1、负责图像相关软件开发；<br>2、现场设备调试；<br>3、编写方案、汇报材料；<br>4、现场调试；<br>任职要求:<br>1、了解光路设计，了解图像的拼接校正原理，了解多通道投影机融合原理；<br>2、对画面显示颜色敏感，拥有实际调试经验；<br>3、了解计算机图形学，并有相关软件开发经验；<br>4、了解投影显示、LED显示画面多通道拼接；<br>5、了解图像处理硬件；<br>6、了解飞行视景系统；；', link: 'https://xym.51job.com/personal/personal_applyjob.aspx?ctmid=6393432&jobid=150585272', xl: '硕士'},
//   {xz:"8-12", type: '专业技术类', zn: '项目管理', jobname: '项目管理', addr: '上海', zhuanye: '交通/运输/物流类', zz: '学历要求:本科及以上<br>所需专业:工业工程、工程管理、电子电器等相关专业<br>岗位职责:<br>1、在授权范围内组织开展项目合同/协议谈判；<br>2、组织开展项目整体策划，包括项目WBS、项目进度、预算和成本、风险管控等；<br>3、负责组织开展项目的各项评审活动；<br>4、负责项目实施过程的监督、协调等工作。<br>任职要求:<br>1、具有工业工程、机械或电子电器专业专业知识，具有项目管理相关知识；<br>2、认真负责、积极主动、沟通能力 强、团队意识强；<br>3、有较强的独立解决问题能力、沟通、语言表达能力强。；', link: 'https://xym.51job.com/personal/personal_applyjob.aspx?ctmid=6393432&jobid=150585273', xl: '本科'},
//   {xz:"12-15", type: '研发类', zn: '硬件工程师', jobname: '硬件工程师（测试）', addr: '上海', zhuanye: '交通/运输/物流类', zz: '学历要求:硕士研究生<br>所需专业:自动化、测控技术与仪器、电力电子等相关专业<br>岗位职责:<br>1、负责识别和提出测试需求,负责开展测试需求分析；<br>2、负责开展测试需求分析；<br>3、拟制总体测试策略；<br>4、对测试设计质量把关；<br>5、持续跟踪测试需求；<br>6、负责测试领域的技术竞争力。<br>任职要求:<br>1、熟悉嵌入式技术、EMC技术，具有扎实的数字、模拟电路专业理论基础和较强的电路分析能力；<br>2、熟练使用计算机辅助设计软件（Altium Designer 、CAXA CAD、Quartus II 等）；<br>3、具有测试验证相关经验者优先；<br>4、熟悉飞机供配电系统优先考虑；<br>5、具有较强的沟通能力、高度负责心、良好的创新精神和团队精神；<br>6、能数量操作各种测试设备和测量工具。；', link: 'https://xym.51job.com/personal/personal_applyjob.aspx?ctmid=6393432&jobid=150585274', xl: '硕士'},
//   {xz:"12-15", type: '研发类', zn: '硬件工程师', jobname: '硬件工程师（固态功率配电）', addr: '上海', zhuanye: '交通/运输/物流类', zz: '学历要求:硕士研究生<br>所需专业:自动化、 电子信息工程、计算机科学与技术、电力电子等相关专业<br>岗位职责:<br>1、负责对安排的配电产品技术状态进行确认，提供计划节点参考意见，参与设计（编制）研制方案；<br>2、在产品设计中，充分考虑可靠性、维修性、综合保障性、安全性、测试性、环境适应性、可制造性等工程技术要求；<br>3、负责产品在研制过程的生产、装配、试验等各个环节提供技术支持，及时处理或协助处理产品研制中发生的质量问题，确保研制过程的有序进行。<br><br>任职要求:<br>1、熟悉嵌入式技术、EMC技术，具有扎实的数字、模拟电路专业理论基础和较强的电路分析能力；<br>2、熟练掌握PROTEL/DXP/MENTOR等电路设计工具，能熟练进行PCB设计；<br>3、具有单片机/DSP/PowerPC/ARM等平台硬件开发经验，有高速处理平台开发经验者优先考虑；<br>4、熟悉飞机供配电系统优先考虑。；', link: 'https://xym.51job.com/personal/personal_applyjob.aspx?ctmid=6393432&jobid=150585275', xl: '硕士'},
//   {xz:"12-15", type: '研发类', zn: '硬件工程师', jobname: '硬件工程师（照明驱动与控制）', addr: '上海', zhuanye: '交通/运输/物流类', zz: '学历要求:硕士研究生<br>所需专业: 自动化、电气工程、机电一体化等相关专业<br>岗位职责:<br>1、负责与用户协调沟通产品相关的技术条件，并给予用户相关支持；<br>2、负责产品硬件部分的设计及相关工作；<br>3、负责产品方案的设计；<br>4、负责产品元器件选型、原理图设计、PCB设计。<br>任职要求:<br>1、熟练掌握PROTEL/DXP/MENTOR等电路设计工具，能熟练进行PCB设计；<br>2、熟悉嵌入式技术、EMC技术，具有扎实的数字、模拟电路专业理论基础和较强的电路分析能力；<br>3、清晰的产品设计思路，良好的团队合作意识、精益求精的工作心态；<br>4、具有单片机/DSP/PowerPC/ARM等平台硬件开发经验，有高速处理平台开发经验者优先考虑；<br>5、具有CPLD/FPGA（Xilinx）设计经验，有FIFO、RAM、串并转换等项目经验者优先考虑。；', link: 'https://xym.51job.com/personal/personal_applyjob.aspx?ctmid=6393432&jobid=150585276', xl: '硕士'},
//   {xz:"8-12", type: '专业技术类', zn: '质量管理/测试工程师(QA/QC工程师)', jobname: '质量工程师', addr: '上海', zhuanye: '交通/运输/物流类', zz: '学历要求:本科及以上<br>所需专业:工业工程、机械工程、电气工程、自动化、适航管理等相关专业<br>岗位职责:<br>1、负责所承担产品的质量策划工作，编制质量计划 ，并组织监督实施；<br>2、参与项目各类评审及审查工作，监督、检查问题的落实，确保产品质量过程受控；<br>3、负责所有内/外部问题报告的管理，组织、协调所有问题的确认、临时处理、分析纠正预防等工作；<br>4、负责组织质量目标的统计 、分析及改善工作。<br>任职要求:<br>1、具有工业工程、机械或电子电器专业专业知识；<br>2、认真负责、积极主动、沟通能力强、团队意识强；<br>3、有较强的独立解决问题能力、沟通、语言表达能力强；<br>4、具有与技术相关的英语读写能力。；', link: 'https://xym.51job.com/personal/personal_applyjob.aspx?ctmid=6393432&jobid=150585277', xl: '本科'}
// ]

// var jobs = [
//   {xz:"8-12", type: '工艺类', jobname: 'IE工程师', zn: '工业工程师', addr: '上海', xl: '本科', zz: '<br>岗位职责：<br>1、负责产能产线规划、生产现场优化、制造成本改善、工厂布局设计等方面相关工作。包含但不限于以下方面：<br>2、 负责精益生产、IE改善技术的研究；<br>3、 运用精益手法分析、发现问题，组织对当前制造相关流程、工艺方法、制造成本等提出改善建设方案；<br>4、根据产能情况组织开展例行性短中长期规划、组织设计解决方案并推动实施；<br>5、 根据组织架构与规划发展需要，开展制造工厂布局设计与优化。<br>任职要求：<br>1、了解电子行业相关制造标准，了解生产制造流程；<br>2、具备较强的统筹规划能力和系统协调能力；<br>3 、具有良好的语言文字表达能力与结构化思维，具有团队合作精神。<br>', xl1: '本科及以上', zy: '工业工程、数学、信息管理、电力电子等相关专业', link: 'https://xyz.51job.com/external/apply.aspx?jobid=150585250&ctmid=6393432'},
//   {xz:"8-12", type: '工艺类', jobname: '测试工程师', zn: '测试工程师', addr: '上海', xl: '本科', zz: '<br>岗位职责：<br>1、处理电子产品故障原因分析定位；<br>2、进行新研电子产品调试测试；<br>3、编制电子产品故障排查定位方法以及知识积累；<br>4、编制电子产品专用测试设备技术需求书以及固定资产报告；<br>5、调研行业内在测试领域新技术，提升配电产品在测试方面工作效率；<br>6、研究设计产品测试工装优化测试方法。<br>任职要求：<br>1、具有扎实的数字、模拟电路专业理论基础，熟悉单片机、DSP等处理器的原理及外围电路电路设计；<br>2、熟练使用常见万用表、示波器、电子负载仪表设备；<br>3、具有硬件电路电路分析和设计能力、调试和问题解决能力者优先；<br>4、熟悉C++、C#、Java、Python等编程语言者优先。', xl1: '本科及以上', zy: '自动化、电气工程、电子信息工程等相关专业', link: 'https://xyz.51job.com/external/apply.aspx?jobid=150585251&ctmid=6393432'},
//   {xz:"8-12", type: '工艺类', jobname: '产品工程师', zn: '产品工艺/制程工程师', addr: '上海', xl: '本科', zz: '<br>岗位职责：<br>1、承担航空防务和非航空防务的产品制造工艺，根据产品图纸要求和产品规范要求编制工艺文件指导生产；<br>2、能够及时有效的处理装配现场在生产过程中的异常情况；<br>3、对生产过程中或外场使用中出现的故障，及时准确定位，快速排除；<br>4、积极研究新工艺，新方法，不断创新，提高现有工艺能力。<br>任职要求：<br>1、具备扎实的模电、数电和电路分析或光学的专业知识基础；<br>2、熟悉运用AutoCAD、protel等常用软件或熟悉LED照明及常用LED光学特性掌握一款光学软件；<br>3、工作踏实认真细致，有良好的沟通协调能力。', xl1: '本科及以上', zy: '机械工程、电子信息工程、电气工程、自动化、光学工程等相关专业', link: 'https://xyz.51job.com/external/apply.aspx?jobid=150585252&ctmid=6393432'},
//   {xz:"12-15", type: '研发类', jobname: '电磁兼容工程师', zn: '变压器与磁电工程师', addr: '上海', xl: '硕士', zz: '<br>岗位职责：<br>1、参与产品电磁兼容性设计、分析、试验、验证等相关工作；<br>2、负责航空电子产品的结构屏蔽效能仿真，电路电磁辐射仿真，电路的SI/PI仿真等方面工作；<br>3、参与项目评审，对产品的电磁兼容性设计进行评估；并提供改进意见或者建议；<br>4、负责电容兼容性设计相关文档编制；<br>5、负责电磁兼容性相关流程的制定和改进。<br>任职要求：<br>1、熟练使用或了解电磁兼容仪器设备、频谱仪、接收机等；<br>2、具备电磁场与微波技术相关专业的基础知识；<br>3、具备数电，模电、射频电路等相关专业的基础知识；<br>4、能运用CST/HFSS/FEKO/ADS 等软件者优先；<br>5、具有EMC测试或整改经验者优先；<br>6、工作勤恳、品行端正，有较强的的责任意识和良好的团队精神。 ', xl1: '硕士及以上<br>', zy: '电气工程、微电子学与固体电子学、电磁场与微波技术等相关专业', link: 'https://xyz.51job.com/external/apply.aspx?jobid=150585253&ctmid=6393432'},
//   {xz:"12-15", type: '研发类', jobname: '电气工程师', zn: '电气工程师/技术员', addr: '上海', xl: '硕士', zz: '<br>岗位职责：<br>1、按照项目要求完成方案、器件选型、原理图设计、调试、测试等工作，并负责产品的设计质量；<br>2、编写产品研制过程各种支撑性文件；<br>3、负责承担产品的生产、外场质量问题的处理及技术支持工作；<br>4、跟踪研究专业技术领域的技术发展；<br>5、开展配电控制技术的知识积累及成果申报。<br>任职要求：<br>1、具有扎实的电气工程专业理论基础，熟悉工业、自动化电气设计；<br>2、熟练掌握caxa等电气图设计工具者优先；<br>3、具有工业自动化设备分析和设计能力、调试和问题解决能力者优先；<br>4、熟悉项目的统筹与管控，有良好的沟通协调能力，良好的团队精神。', xl1: '硕士研究生', zy: '自动化、电气工程、机电一体化等相关专业', link: 'https://xyz.51job.com/external/apply.aspx?jobid=150585254&ctmid=6393432'},
//   {xz:"12-15", type: '研发类', jobname: '高分子材料工程师', zn: '材料工程师', addr: '上海', xl: '硕士', zz: '<br>岗位职责：<br>1、开展高性能导电材料及其在隐身方向应用研究；<br>2、开展进行多功能电磁屏蔽/吸波材料研究和应用；<br>3、开展进行隐身涂层产线建设和工艺研究。<br>任职要求：<br>1、具有导电材料、透明导电膜材料开发经验者优先；<br>2、具备导电复合材料、高分子材料、电磁屏蔽材料、电磁波理论等研究背景；<br>3、具备导电材料、电磁屏蔽材料工艺研究经验者优先；<br>4、有较强的的学习能力和项目开发经验。<br>', xl1: '硕士研究生', zy: '高分子材料科学、高分子化学相关专业', link: 'https://xyz.51job.com/external/apply.aspx?jobid=150585255&ctmid=6393432'},
//   {xz:"12-15", type: '研发类', jobname: '工业设计工程师', zn: '工业设计/产品设计', addr: '上海', xl: '硕士', zz: '<br>岗位职责：<br>1.客户对接，按照客户及产品特点要求完成特种功能舱室总体视觉效果设计，善于用营销概念表达设计创意及体验创新逻辑；<br>2.根据特种装备使用需要，负责特种功能舱室总体方案设计构思，把握设计方向与风格，开展细节设计、CMF等；<br>3.完成效果转化，将工业设计效果转化为结构设计等工作；<br>4.编写产品研制过程各种支撑性文件；<br>5.了解和收集行业信息趋势，视觉表达趋势；<br>6.开展工业设计技术的知识积累及成果申报；<br>7.配合部门做好其他设计相关工作。<br>任职要求：<br>1.具有较好的设计分析及设计表现力，有良好的绘制表达能力；<br>2.熟练掌握（PS，CorelDRAW，3dsmax，catia）等设计软件；<br>3.具有特种功能舱室，车辆造型设计能力者优先；<br>4.善于独立思考，对结构实现、工艺材料等有基本了解；<br>5.熟悉项目的统筹与管控，有良好的沟通协调能力，良好的团队精神；', xl1: '硕士研究生', zy: '工业设计、数字媒体艺术、工业工程等相关专业', link: 'https://xyz.51job.com/external/apply.aspx?jobid=150585257&ctmid=6393432'},
//   {xz:"12-15", type: '研发类', jobname: '光学工程师（LED球幕）', zn: '激光/光电子技术', addr: '上海', xl: '硕士', zz: '<br>岗位职责：<br>1、按需求进行光路分析、光路设计工作；<br>2、负责产品光性能测试’现场光学产品调试；<br>3、负责产品的图纸发布，外协生产跟踪；<br>4、结合项目需求进行产品的方案编写，各类支撑文件编写；<br>5、负责LED屏幕现场监督，根据图纸进行施工；<br>6、负责各类型显示系统设计。<br>任职要求：<br>1、了解LED屏幕显示系统工作原理；<br>2、了解光路分析软件；<br>3、了解LED屏幕的驱动，使用调试方式；<br>4、具备视图能力，能够通过图纸进行现场施工；<br>5、熟练使用CAD/CATIA/Solidworks等二维、三维软件；<br>6、了解大型LED屏幕系统架构及工作原理。', xl1: '硕士研究生', zy: '光学、光学工程、精密仪器、机械等相关专业', link: 'https://xyz.51job.com/external/apply.aspx?jobid=150585258&ctmid=6393432'},
//   {xz:"12-15", type: '研发类', jobname: '光学工程师（激光强光照明）', zn: '激光/光电子技术', addr: '上海', xl: '硕士', zz: '<br>岗位职责：<br>1、配合系统工程师进行需求管理保障工作；<br>2、按需求分解出光学子需求，开展光学零件、组件设计工作，开展光学仿真确定光学详细设计方案；<br>3、负责产品设计、制造、验证、交付过程中光学设计迭代和技术问题处理；<br>4、负责产品评审基础支撑工作，根据评审意见认真落实技术归零，完成光学专业所需文件编制；<br>5、负责产品光学图纸出版工作，负责光学零部组件、装配等图出版工作；<br>6、负责系统/产品光性能测试验证、照明实验工作。<br>任职要求：<br>1、至少熟练使用一款光学软件（DIALux、TracePro、lightools等）；<br>2、对几何光学有较深理论基础；<br>3、对光学零组件加工工艺、注塑模具、滤光材料等有基本认识；<br>4、具有较强的沟通能力、高度责任心、良好的创新精神和团队精神；<br>5、有LED光源或照明环境光学设计仿真课题经验者优先。', xl1: '硕士研究生', zy: '光学科学与技术、光学工程、物理学等相关专业', link: 'https://xyz.51job.com/external/apply.aspx?jobid=150585259&ctmid=6393432'},
//   {xz:"15-20", type: '研发类', jobname: '光学工程师（拒止类武器）', zn: '激光/光电子技术', addr: '上海', xl: '博士', zz: '<br>岗位职责：<br>1、负责激光应用光学方向前沿技术跟踪、调研和课题申报工作；<br>2、负责调研及对接客户需求，规划新产品技术路线，并完成技术预研工作；<br>3、负责光学零件、组件设计工作，开展光学仿真确定光学详细设计方案；<br>4、负责产品设计、制造、验证、交付过程中光学设计迭代和技术问题处理；<br>5、负责系统/产品光性能测试验证、照明实验工作。<br>任职要求：<br>1、熟练掌握Zeamx、CodeV等光学设计工具，掌握成像、照明、检测的技术原理，能够设计光学系统实现功能性能指标；<br>2、熟悉激光器、成像光学元件、激光光学元件等光学测试设备，了解国内外激光器发展现状和光学元件主流加工水平，精通成像光学设计；<br>3、精通光学系统性能评价指标以及判断标准，精通必要的光学检测设备以及测量方法；<br>4、具备扎实的光学理论基础，熟悉物理光学和几何光学，对光学理论有着深刻的认识，能够根据设计等要求独立完成光学仪器设备及各光学器件选型和测试，提供完整可行的光学系统解决方案。<br>5、有激光光源、激光材料或照明环境光学设计仿真课题经验者优先。', xl1: '博士研究生', zy: '光学、光学工程、测试计量技术区仪器等光学相关专业', link: 'https://xyz.51job.com/external/apply.aspx?jobid=150585260&ctmid=6393432'},
//   {xz:"8-12", type: '专业技术类', jobname: '技术支持工程师', zn: '技术支持/维护工程师', addr: '上海', xl: '本科', zz: '<br>岗位职责：<br>1．负责部门装备/产品交接装；<br>2．负责部门装备/产品外场技术维护保障；<br>3．负责部门装备/产品客户培训；<br>任职要求：<br>1. 具备客户对接交装能力；<br>2. 具备良好的沟通表达能力；<br>3. 具有基本产品结构、软硬件设计知识，可完成产品外场的基本调试。<br>4. 具备良好的分析和解决问题的能力，可迅速分析故障原因，进行维修方式判断。<br>5. 具备良好逻辑思维能力，可完成客户培训工作。<br>6. 有爱国奉献精神，有国防保密意识，能适应紧张繁重工作', xl1: '本科及以上', zy: '机械工程、自动化、电气工程等相关专业', link: 'https://xyz.51job.com/external/apply.aspx?jobid=150585261&ctmid=6393432'},
//   {xz:"12-15", type: '研发类', jobname: '结构工程师', zn: '结构工程师', addr: '上海', xl: '硕士', zz: '<br>岗位职责：<br>1、负责与用户协调沟通产品相关的技术条件，并给予用户相关支持；<br>2、负责产品结构部分的设计及相关工作，包括器件选型、建立三维模型、以及结构部分图纸出版；<br>3、负责产品相关文档的编写，并参加产品相关的各类评审；<br>4、开展现有器件的质量提升涉及的制造技术攻关。<br>任职要求：<br>1、扎实的机械专业知识，理论力学、材料力学、机械原理、机械设计、电工电子成绩优秀；<br>2、熟悉机械制图、工程力学、材料加工，能够熟练使用AUTOCAD、CATIA、Altium Designer等设计软件；<br>3、具有精益求精的工作心态、良好的团队合作意识、较强的创新能力；<br>4、具备结构专业CAE软件仿真分析能力者优先考虑；<br>5、具有结构设计的项目经历，并完成全部生产过程的优先。', xl1: '硕士研究生', zy: '机械制造及其自动化、机械设计及理论、工业设计等相关专业', link: 'https://xyz.51job.com/external/apply.aspx?jobid=150585262&ctmid=6393432'},
//   {xz:"12-15", type: '研发类', jobname: '可靠性工程师', zn: '可靠度工程师', addr: '上海', xl: '硕士', zz: '<br>岗位职责：<br>1.负责电子类及机电类产品的可靠性、安全性、维修性、测试性等工作规划；<br>2.捕获、维护和管理可靠性、安全性、维修性、测试性需求；<br>3.提供有效的可靠性技术支持；<br>4.参与审核并指导产品的可靠性设计与分析；<br>5.组织并推动开展FMEA、FTA等工作；<br>6.负责可靠性试验的策划管理及大纲编制指导工作；<br>7.能够对试验数据进行分析并根据产品外场使用数据进行可靠性评估工作。<br>任职要求：<br>1.熟悉国内外可靠性标准；<br>2.掌握可靠性分析软件，掌握可靠性分配、预计、评估方法；<br>3.能够完成FMEA、FTA、设计分析等工作；<br>4.具备可靠性试验策划及试验数据分析能力；<br>5.工作积极主动、吃苦耐劳、有责任心，具有良好的沟通能力及团队协作能力。', xl1: '硕士研究生', zy: '电子信息工程、通信工程、 自动化、可靠性、交通运输工程等相关专业', link: 'https://xyz.51job.com/external/apply.aspx?jobid=150585263&ctmid=6393432'},
//   {xz:"12-15", type: '研发类', jobname: '软件工程师（测试）', zn: '软件工程师', addr: '上海', xl: '硕士', zz: '<br>岗位职责：<br>1、负责产品软件测试、验证及相关研制文档输出；<br>2、负责产品软件编码调试、测试；<br>3、负责产品功能验证、调试检测及故障处理工作。<br>任职要求：<br>1、掌握使用Keil工具进行单片机平台的软件编译、程序烧录；<br>2、掌握使用quatusII工具进行CPLD程序的烧写；<br>3、掌握使用xilinx工具进行FPGA程序的开发；<br>4、有testbed软件使用经验者优先考虑。', xl1: '硕士研究生', zy: '计算机科学与技术、软件工程、机械工程等相关专业<br>', link: 'https://xyz.51job.com/external/apply.aspx?jobid=150585265&ctmid=6393432'},
//   {xz:"12-15", type: '研发类', jobname: '软件工程师（嵌入式）', zn: '软件工程师', addr: '上海', xl: '硕士', zz: '<br>岗位职责：<br>1、嵌入式系统产品驱动开发，配合硬件调试、验证；<br>2、嵌入式产品软件开发，嵌入式软件编码实现，调试；<br>3、完成通信接口协议定义，实现通信控制、功能模块级联试；<br>4、负责完成产品的测试工作，如单元测试、单元集成测试、配置项测试系统测试；<br>5、参与编制软件研发过程中的文档。<br>任职要求：<br>1、熟悉单片机、DSP、Linux、Vxworks等一种或者多种嵌入式平台；<br>2、熟悉C/C++/C#，有良好的编程习惯和技巧及技术文档写作能力；<br>3、具有数电模电基础，熟悉软件开发流程；<br>4、熟悉基本的软件测试理论，熟悉软件测试的基本方法、流程和规范；<br>5、具有良好的沟通能力和团队合作能力，具有强烈的责任人和钻研精神；<br>6、具有嵌入式软件的项目经验者优先。', xl1: '硕士研究生', zy: '计算机科学与技术、自动化、软件工程、机械工程等相关专业', link: 'https://xyz.51job.com/external/apply.aspx?jobid=150585266&ctmid=6393432'},
//   {xz:"8-12", type: '专业技术类', jobname: '试验工程师', zn: '实验室负责人/工程师', addr: '上海', xl: '本科', zz: '<br>岗位职责：<br>1、按试验规程或技术规范、试验大纲进行各种试验，并真实有效地填写试验原始记录；<br>2、解决试验过程中的技术难题，配合故障分析、处理；<br>3、参与试验过程中发现的各种故障的分析处理，并提出处理意见，不断完善试验操作过程<br>4、编制有试验类产品标准，促进试验操作规范化。<br>任职要求：<br>1、熟练使用实验室测试仪器，如示波器，频谱分析仪等；<br>2、具备基本的电工电路基础，能看懂电路原理图，有可靠性试验数据统计分析能力；<br>3、具有较强的沟通能力、高度负责心、良好的创新精神和团队精神；<br>4、有环境实验室实习经验者优先。', xl1: '本科及以上', zy: '电气工程、机械设计、制造及自动化、力学相关专业', link: 'https://xyz.51job.com/external/apply.aspx?jobid=150585267&ctmid=6393432'},
//   {xz:"12-15", type: '研发类', jobname: '算法工程师（AI）', zn: '算法工程师', addr: '上海', xl: '硕士', zz: '<br>岗位职责：<br>1、从事至少以下一种算法的研发：图像识别、语音识别、自然语言处理、声纹识别、语种识别、音频信号处理、手势识别、人脸识别、目标检测、动作检测；<br>2、开展机器学习、深度学习等相关算法理论研究，探索人工智能在航空领域的应用并进行原理样机的开发工作<br>3、参与公司AI科研项目的开发工作，完成相关算法和软件功能开发。<br><br>任职要求：<br>1、具备扎实的模式识别、图像处理、机器学习、自然语言处理、语音识别等知识和项目研发经验，对深度学习理论有一定的研究和应用经历；<br>2、良好的编程基础，掌握c/c++/python等编程开发语言和常用数据结构；<br>3、熟悉人工智能相关领域的最新进展和技术，擅于文献整理和信息情报收集，具有较强的英文阅读能力和科研论文撰写能力；<br>4、具备良好的创新和团队合作精神，能承受一定的工作压力。', xl1: '硕士研究生', zy: '计算机科学与技术、软件工程、模式识别与智能系统等相关专业<br>', link: 'https://xyz.51job.com/external/apply.aspx?jobid=150585268&ctmid=6393432'},
//   {xz:"12-15", type: '研发类', jobname: '算法工程师（导航）', zn: '算法工程师', addr: '上海', xl: '硕士', zz: '<br>岗位职责：<br>1、 融合定位及组合导航算法研究；<br>2、行业前沿技术及解决方案调研；<br>3、前沿技术及算法的仿真及工程化实现；<br>4、系统产品的研制及测试验证；<br>5、协助开展产品的市场推广应用及相关工作。<br><br>任职要求：<br>1、导航、制导与控制，飞行控制，控制工程与控制理论相关专业,硕士或博士；<br>2、具备惯性导航、组合导航定位的算法研究、仿真经验优先；<br>3、具备图像、IMU、LIDAR等的组合导航定位技术研究经验；<br>4、掌握基本的组合导航定位算法卡尔曼滤波算法、粒子滤波等相关算法；<br>5、具有较强的独立科研能力，能熟练进行文献检索和综述；<br>6、工作主动认真，具有较强的学习能力，乐于沟通，有团队意识。', xl1: '硕士研究生', zy: '自动化、导航、制导与控制等相关专业', link: 'https://xyz.51job.com/external/apply.aspx?jobid=150585269&ctmid=6393432'},
//   {xz:"12-15", type: '研发类', jobname: '算法工程师（近地告警）', zn: '算法工程师', addr: '上海', xl: '硕士', zz: '<br>岗位职责：<br>1、飞行动力学及运动学特性建模与研究；<br>2、实时规避预测、轨迹规划与控制算法研究；<br>3、国内同产品技术前沿跟踪研究；<br>4、低空飞行安全防撞技术的工程化与验证技术研究；<br>5、同类产品的研制与系统测试研制；<br>6、开展地形辅助导航，在飞机近地告警、导航定位等方面的工程化应用研究。<br>任职要求：<br>1、导航、制导与控制，飞行控制，控制工程与控制理论相关专业,硕士或博士；<br>2、具有飞行动力学建模及控制系统设计仿真经验优先；<br>3、具有近地告警/地形防撞/地形跟随/地形规避等相关方向研究经验者优先；<br>4、具有较强的独立科研能力，能熟练进行文献检索和综述；<br>5、工作主动认真，具有较强的学习能力，乐于沟通，有团队意识。', xl1: '硕士研究生', zy: '自动化、导航、制导与控制、飞行器设计、计算机科学与技术等相关专业', link: 'https://xyz.51job.com/external/apply.aspx?jobid=150585270&ctmid=6393432'},
//   {xz:"12-15", type: '研发类', jobname: '通信工程师', zn: '通信技术工程师', addr: '上海', xl: '硕士', zz: '<br>岗位职责：<br>1.客户前期通信方案对接，理解客户需求，梳理外部产品和内部设备交联关系；<br>2.通信设备类选型设计及协议，相关技术文件编制；网络设备的验收、调测等技术支持；<br>3.搭建设备bom及编制电气连接图纸；<br>4.负责产品研发过程中的通信问题解决；<br>5.进行产品研发过程中通信方面的经验积累和成果申报；<br>6.配合客户进行系统联调联试、升级维护和排故；<br>7.配合其他技术工程师设计相关工作<br>任职要求：<br>1.具备一定技术背景，熟悉通信设备软硬件设计及开发，掌握主流开发工具；<br>2.数量掌握网络基础理论和路由器、交换机等网络设备；<br>3.刻苦耐劳，能独立出差完成任务，具备良好的沟通和学习能力，良好的团队及创新精神。', xl1: '硕士研究生', zy: '电子信息工程、通信工程等相关专业', link: 'https://xyz.51job.com/external/apply.aspx?jobid=150585271&ctmid=6393432'},
//   {xz:"12-15", type: '研发类', jobname: '图像处理工程师', zn: 'FPGA开发工程师', addr: '上海', xl: '硕士', zz: '<br>岗位职责：<br>1、负责图像相关软件开发；<br>2、现场设备调试；<br>3、编写方案、汇报材料；<br>4、现场调试；<br>任职要求：<br>1、了解光路设计，了解图像的拼接校正原理，了解多通道投影机融合原理；<br>2、对画面显示颜色敏感，拥有实际调试经验；<br>3、了解计算机图形学，并有相关软件开发经验；<br>4、了解投影显示、LED显示画面多通道拼接；<br>5、了解图像处理硬件；<br>6、了解飞行视景系统；', xl1: '硕士研究生', zy: '计算机科学与技术、软件工程、光学、光学工程等相关专业', link: 'https://xyz.51job.com/external/apply.aspx?jobid=150585272&ctmid=6393432'},
//   {xz:"8-12", type: '专业技术类', jobname: '项目管理', zn: '项目管理', addr: '上海', xl: '本科', zz: '<br>岗位职责：<br>1、在授权范围内组织开展项目合同/协议谈判；<br>2、组织开展项目整体策划，包括项目WBS、项目进度、预算和成本、风险管控等；<br>3、负责组织开展项目的各项评审活动；<br>4、负责项目实施过程的监督、协调等工作。<br>任职要求：<br>1、具有工业工程、机械或电子电器专业专业知识，具有项目管理相关知识；<br>2、认真负责、积极主动、沟通能力 强、团队意识强；<br>3、有较强的独立解决问题能力、沟通、语言表达能力强。', xl1: '本科及以上', zy: '工业工程、工程管理、电子电器等相关专业', link: 'https://xyz.51job.com/external/apply.aspx?jobid=150585273&ctmid=6393432'},
//   {xz:"12-15", type: '研发类', jobname: '硬件工程师（测试）', zn: '硬件工程师', addr: '上海', xl: '硕士', zz: '<br>岗位职责：<br>1、负责识别和提出测试需求,负责开展测试需求分析；<br>2、负责开展测试需求分析；<br>3、拟制总体测试策略；<br>4、对测试设计质量把关；<br>5、持续跟踪测试需求；<br>6、负责测试领域的技术竞争力。<br>任职要求：<br>1、熟悉嵌入式技术、EMC技术，具有扎实的数字、模拟电路专业理论基础和较强的电路分析能力；<br>2、熟练使用计算机辅助设计软件（Altium Designer 、CAXA CAD、Quartus II 等）；<br>3、具有测试验证相关经验者优先；<br>4、熟悉飞机供配电系统优先考虑；<br>5、具有较强的沟通能力、高度负责心、良好的创新精神和团队精神；<br>6、能数量操作各种测试设备和测量工具。', xl1: '硕士研究生', zy: '自动化、测控技术与仪器、电力电子等相关专业', link: 'https://xyz.51job.com/external/apply.aspx?jobid=150585274&ctmid=6393432'},
//   {xz:"12-15", type: '研发类', jobname: '硬件工程师（固态功率配电）', zn: '硬件工程师', addr: '上海', xl: '硕士', zz: '<br>岗位职责：<br>1、负责对安排的配电产品技术状态进行确认，提供计划节点参考意见，参与设计（编制）研制方案；<br>2、在产品设计中，充分考虑可靠性、维修性、综合保障性、安全性、测试性、环境适应性、可制造性等工程技术要求；<br>3、负责产品在研制过程的生产、装配、试验等各个环节提供技术支持，及时处理或协助处理产品研制中发生的质量问题，确保研制过程的有序进行。<br><br>任职要求：<br>1、熟悉嵌入式技术、EMC技术，具有扎实的数字、模拟电路专业理论基础和较强的电路分析能力；<br>2、熟练掌握PROTEL/DXP/MENTOR等电路设计工具，能熟练进行PCB设计；<br>3、具有单片机/DSP/PowerPC/ARM等平台硬件开发经验，有高速处理平台开发经验者优先考虑；<br>4、熟悉飞机供配电系统优先考虑。', xl1: '硕士研究生', zy: '自动化、 电子信息工程、计算机科学与技术、电力电子等相关专业', link: 'https://xyz.51job.com/external/apply.aspx?jobid=150585275&ctmid=6393432'},
//   {xz:"12-15", type: '研发类', jobname: '硬件工程师（照明驱动与控制）', zn: '硬件工程师', addr: '上海', xl: '硕士', zz: '<br>岗位职责：<br>1、负责与用户协调沟通产品相关的技术条件，并给予用户相关支持；<br>2、负责产品硬件部分的设计及相关工作；<br>3、负责产品方案的设计；<br>4、负责产品元器件选型、原理图设计、PCB设计。<br>任职要求：<br>1、熟练掌握PROTEL/DXP/MENTOR等电路设计工具，能熟练进行PCB设计；<br>2、熟悉嵌入式技术、EMC技术，具有扎实的数字、模拟电路专业理论基础和较强的电路分析能力；<br>3、清晰的产品设计思路，良好的团队合作意识、精益求精的工作心态；<br>4、具有单片机/DSP/PowerPC/ARM等平台硬件开发经验，有高速处理平台开发经验者优先考虑；<br>5、具有CPLD/FPGA（Xilinx）设计经验，有FIFO、RAM、串并转换等项目经验者优先考虑。', xl1: '硕士研究生', zy: '自动化、电气工程、机电一体化等相关专业', link: 'https://xyz.51job.com/external/apply.aspx?jobid=150585276&ctmid=6393432'},
//   {xz:"8-12", type: '专业技术类', jobname: '质量工程师', zn: '质量管理/测试工程师(QA/QC工程师)', addr: '上海', xl: '本科', zz: '<br>岗位职责：<br>1、负责所承担产品的质量策划工作，编制质量计划 ，并组织监督实施；<br>2、参与项目各类评审及审查工作，监督、检查问题的落实，确保产品质量过程受控；<br>3、负责所有内/外部问题报告的管理，组织、协调所有问题的确认、临时处理、分析纠正预防等工作；<br>4、负责组织质量目标的统计 、分析及改善工作。<br>任职要求：<br>1、具有工业工程、机械或电子电器专业专业知识；<br>2、认真负责、积极主动、沟通能力强、团队意识强；<br>3、有较强的独立解决问题能力、沟通、语言表达能力强；<br>4、具有与技术相关的英语读写能力。', xl1: '本科及以上', zy: '工业工程、机械工程、电气工程、自动化、适航管理等相关专业', link: 'https://xyz.51job.com/external/apply.aspx?jobid=150585277&ctmid=6393432'}
// ]

var params = {
  ctmid: "6393432", //会员号
  coid: "",
  divid: "", //部门
  jobarea: "", //工作地点
  functype: "", //职能
  pagesize: "1000", //每页数默认值10,最大2000
  pagenum: "", //第几页认值1,最大100
  keyword: "", //职位名称关键字
  csid: "", //行程id
  salary: "", //薪资
  degreefrom: "", //学历
  issuedate: "", //发布日期
  poscode: "01",
  searchArr1: "",
  searchArr: "",
  providesalaryname: "",
  term: "", //0:全职1:兼职 4:实习（全职）5:实习（兼职）
  isurgency: "", //是否热招 0 否  1 是
  sort: "", //职位排序字段coid、divid、jobarea、functype、poscode、joborder、issuedate、mark
  sequence: 1, //1：正序;0：倒序;
  // jobid:141394839,
  // jkeyword: ""
};
getJobCondition();
function getJobCondition() {
  coapi.getJobCondition(
    params.ctmid,
    function (data) {
      //取到数据之后的操作
      console.log(data, "搜索器列表");
      var functype = data.resultbody.functype;
      var degreefrom = data.resultbody.degreefrom;
      let template = '<option value="">-职能类别-</option>';
      for (let i = 0; i < functype.length; i++) {
        template += `<option value="${functype[i].key}">${functype[i].value}</option>`;
      }
      $("#lb").html(template);

      let template1 = '<option value="">-学历要求-</option>';
      for (let i = 0; i < degreefrom.length; i++) {
        template1 += `<option value="${degreefrom[i].key}">${degreefrom[i].value}</option>`;
      }
      $("#xl").html(template1);
    },
    params
  );
}
joblist();
function joblist() {
  coapi.getJobList(
    params,
    function (data) {
      //取到数据之后的操作
      console.log(data, "职位列表---原");
      var joblist = data.resultbody.joblist;
      var template2 = "";
      console.log(joblist !== undefined, "111");

      if (joblist !== undefined) {
        for (let i = 0; i < joblist.length; i++) {
          template2 += `
              <div class="list">
                  <div class="list-item" lock='0' data-jobid="${joblist[i].jobid}">
                      <img class="icon" src="./images/page2/icon.png" alt="">
                      <p class="job">${joblist[i].jobname}</p>
                      <img class="xia" src="./images/page2/xia.png" alt="">
                  </div>
                  <div class="list-detail hide">

                  </div>
              </div>
          `;
        }
      } else {
        template2 = `<p class='tip'>暂无数据</p>`;
      }
      $(".listbox").html(template2);
    },
    params
  );
}
$(document).on("click", ".list-item", function () {
  let lock = $(this).attr("lock");
  var id = $(this).attr("data-jobid");
  var _than = $(this);
  if (lock == "0") {
    coapi.getJobDetail(id, function (data) {
      //取到数据之后的操作
      console.log(data, "职位详情");
      // var html = data.resultbody.jobinfo
      html = `

        
        <p class="txt">${data.resultbody.jobinfo
          .replace(/(^\d、)|(工作地点：\W+)/gm, "$1")
          .replace(
            /(岗位职责：|岗位要求：|任职要求：|学历要求：|所需专业：)/gm,
            "<span>$1</span>"
          )}</p>
        
        <p class="t">工作地点：</p>
        <p class="txt">${data.resultbody.jobareaname}</p>
        <a class="btn" href="http://xyz.51job.com/external/apply.aspx?jobid=${
          data.resultbody.jobid
        }&ctmid=${
        data.resultbody.ctmid
      }"><img src="./images/page2/btn.png" alt=""></a>
        `;
      _than.siblings(".list-detail").html(html);
    });

    $(".list-detail").slideUp();
    $(".xia").removeClass("rota");
    $(this).find(".xia").addClass("rota");
    $(".list-item").attr("lock", "0");
    $(this).attr("lock", "1");
    $(this).siblings(".list-detail").slideDown();
  } else {
    $(this).siblings(".list-detail").slideUp();
    $(this).attr("lock", "0");
    $(this).find(".xia").removeClass("rota");
  }
});

const video1 = document.getElementById("video1");
const video2 = document.getElementById("video2");
$(".navbox .nav").on("click", function () {
  let index = $(this).index();
  $(".box").hide();
  $(`.box${index + 1}`).show();
  video1.pause();
  video2.pause();
  if (index == 1) {
    // renderlist(jobs)
  }
});

$(".box2 .navBox .nav").on("click", function () {
  $(this).addClass("on").siblings().removeClass("on");
  var poscode = $(this).attr("data-id");
  params.poscode = poscode;
  joblist();

  // renderlist(jobs)
});

$(".searchbtn").on("click", function () {
  params.functype = $("#lb").val();
  params.degreefrom = $("#xl").val();
  joblist();
  // renderlist(jobs)
});

$("#keyword").change(function () {
  params.keyword = $("#keyword").val();
  console.log("keyword");
  joblist();
});
$(".searchicon").click(function () {
  params.keyword = $("#keyword").val();
  joblist();
});
